planet/app/controllers/application_controller.rb

    def check_login
        if session[:user_id] == nil
            puts session[:user_id]
            redirect_to "/login"
        else
            @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]