planet/app/controllers/authentication_controller.rb

    def validate
        username = params[:username]
        password = params[:password]
        if @user = User.find_by_username(username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mohseentech"], ["LIMIT", 1]]