planet/app/controllers/posts_controller.rb

  def create
    @user = User.find(session[:user_id])
    post = @user.posts.new
    post.caption = params[:caption]
    post.content = params[:content]

    if( post.save)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", nil], ["caption", "kya bolti public"], ["user_id", 7], ["created_at", "2023-03-05 17:21:07.611777"], ["updated_at", "2023-03-05 17:21:07.611777"]]