planet/app/controllers/users_controller.rb

  def profile
    @user = User.find(params[:id])
    @posts = @user.posts.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]

  def create
    @user = User.new
    @user.username = params[:username]
    @user.name = params[:name]
    @user.email = params[:email]
    @user.password = params[:password]
    @user.phone = params[:phone]
    @user.profile_picture = params[:profile_picture]
    if @user.save
---
INSERT INTO "users" ("username", "name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)